'use strict';


// 	1) Какое будет выведено значение: 
// let x = 5; alert( ч++ );


// 2) Чему равно такое выражение:
// [ ] + false - null + true
// console.log([] + false) - null + true);  // 'NaN'


// 3) Что выведет этот код
// let y = 1;
// let x = y = 2;
// alert(x);  // буде 2




// •	Чему равна сумма [ ] + 1 + 2?
// console.log([] + 1 + 2); // '12'




// •	Что выведет этот код: 
// alert( "1"[0] ); // 1




// •	Чему равно
// 2 && 1 && null && 0 && undefined ?

// console.log(2 && 1 && null && 0 && undefined); // null
// И запинається на лжи null false
// ИЛИ запинаеться на правде




// •	Есть ли разница между выражениями? 
// !!( a && b ) и (a && b)?

// console.log(!!( 1 && 2 ) === (1 && 2)); // false




// •	Что выведет этот код: 
            // 3
// alert( null || 2 && 3 || 4 ); ?




//	a = [1, 2, 3]; b = [1, 2, 3]; Правда ли что a == b ?

// const a = [1, 2, 3];
// const b = [1, 2, 3];

// console.log(a == b);





// •	Что выведет этот код: 

// alert( +"Infinity" ); // Виведе Infinity




// •	Верно ли сравнение: 
// "Ёжик" > "яблоко";

// console.log('Ёжик' > "яблоко");




// Чему равно 
// 0 || "" || 2 || undefined || true || falsе ?
// 0  то є false
// "" то є false
// 2  то є true
// а дальше код не піде.