'use strict';

// Напишіть умову if, щоб перевірити, чи age знаходиться між 14 та 90 включно.

// “Включно” означає, що age може досягати країв 14 або 90.



// if (age >= 14 && age <= 90)



// Перевірте значення поза діапазоном

// Напишіть умову if, щоб перевірити, чи значення age НЕ знаходиться між 14 та 90 включно.

// Створіть два варіанти: перший з оператором НЕ !, другий — без нього.

// Перший варіант:

// if (!(age >=14 && age <=90));


// Другий варіант:

// if (age < 14 || age > 90);






// Перевірте логін


// Напишіть код, який запитує логін за допомогою prompt.

// Якщо відвідувач вводить "Admin", тоді запропонуйте за допомогою prompt ввести пароль.
//  Якщо введено порожній рядок або натиснуто Esc – показати “Скасовано”. Якщо введено інший рядок – 
// тоді покажіть “Я вас не знаю”.

// Пароль перевіряється наступним чином:

// Якщо він дорівнює “Господар”, тоді покажіть “Ласкаво просимо!”,
// Інший рядок – покажіть “Неправильний пароль”,
// Для порожнього рядка, або якщо введення було скасовано, покажіть “Скасовано”.
// Схема:


let userName = prompt('Хто Ви?');

if ('userName' === 'Admin'); {

    let pass = prompt('Pass?');

    if ('pass === bebe');

    alert('Ласкаво просимо!');
} 
    else if (pass === '' || pass === null) {
        alert( 'Скасовано' );
    }
        
    