// Оголосіть дві змінні: admin та name.
// Присвойте значення "Іван" змінній name.
// Скопіюйте значення зі змінної name в admin.

// Виведіть значення змінної admin, використовуючи функцію alert (яка повинна показати “Іван”).


'use strict';

let admin;           // змінна admin
let name = 'Іван';  // змінна name

admin = name;

alert (admin);


// Придумайте правильні імена
// 1 Створіть змінну із назвою нашої планети. Як би ви назвали таку змінну?
// 2 Створіть змінну для зберігання імені поточного відвідувача сайту. Як би ви назвали таку змінну?

let ourPlanetName = 'Earth';
let currentSiteVisitor = 'Іван';





// Переглянемо наступний код:

const birthday = '18.04.1982';

const age = someCode(birthday);
// В нас є константа birthday, а також age, яка вираховується за допомогою функції, 
// використовуючи значення із birthday (в даному випадку деталі не мають значення, тому код функції не розглядається).
// Чи можна використовувати великі букви для імені birthday? А для age? Чи для обох змінних?

const BIRTHDAY = '18.04.1982'; // використовувати великі букви? так

const AGE = someCode(BIRTHDAY); // а тут? ні








