// // // Які кінцеві значення всіх змінних a, b, c та d після виконання коду нижче?


// // let A = 1, b = 1;

// // let c = ++A; // 2
// // let d = B++; // 1

// // A = 2;
// // B = 2;
// // c = 2;
// // d = 1;

// // let A = 1, B = 1;

// // alert( ++A ); // 2, префіксна форма повертає нове значення
// // alert( B++ ); // 1, постфіксна форма повертає старе значення

// // alert( A ); // 2, збільшується один раз
// // alert( B ); // 2, збільшується один раз








// // // Які значення мають a та x після виконання коду нижче?


// // let a = 2;

// // let x = 1 + (a *= 2);

// // a = 4;
// // x = 5;

// // // Відповідь:

// // // a = 4 (помножиться на 2)
// // // x = 5 (обчислюється як 1 + 4)


//     Добре подумайте, запишіть, а потім порівняйте з відповіддю.
// "" + 1 + 0 = "10" // (1)
// "" - 1 + 0 = -1 // (2)
// true + false = 1
// 6 / "3" = 2
// "2" * "3" = 6
// 4 + 5 + "px" = "9px"
// "$" + 4 + 5 = "$45"
// "4" - 2 = 2
// "4px" - 2 = NaN
// "  -9  " + 5 = "  -9  5" // (3)
// "  -9  " - 5 = -14 // (4)
// null + 1 = 1 // (5)
// undefined + 1 = NaN // (6)
// " \t \n" - 2 = -2 // (7)


// 1 Додавання пустого рядка "" до 1 перетворює число 1 на рядок: "" + 1 = "1"; далі ми маємо "1" + 0, де застосовується те ж саме правило.
// 2 Віднімання - (як і більшість математичних операцій) працює тільки з числами, воно перетворює порожній рядок "" на 0.
// 3 Додавання з рядком додає число 5 до рядка.
// 4 Віднімання завжди перетворює на числа, тому рядок " -9 " перетвориться на число -9 (ігноруючи пробіли навколо нього).
// 5 null стає 0 після числового перетворення.
// 6 undefined стає NaN після числового перетворення.
// 7 Символи пробілів по краях рядка ігноруються під час перетворення в число. Тому рядок, який містить лише символи \t, \n або «звичайні» пробіли, прирівнюється до пустого рядка і стає 0 після числового перетворення.


// Нижче наведено код, що просить користувача ввести два числа і відображає їхню суму.

// Він працює неправильно. Код у прикладі виводить 12 (для початкових значень у полях вводу).

// У чому помилка? Виправте її. Результат має бути 3.





let a = +prompt("Перше число?", 1); // Вставити + можна безпосередньо перед prompt:
let b = +prompt("Друге число?", 2); // Вставити + можна безпосередньо перед prompt:

alert( +a + +b ); // 12

// В останньому варіанті унарний і бінарний + використовуються разом. Виглядає химерно, чи не так?